README.org
#+STATUS: "mustread" "important" "interesting" ""
#+COLUMNS: %120ITEM %STATUS
#+OPTIONS: num:nil author:t prop:t toc:t
#+AUTHOR: Roberto Bifulco, Gábor Rétvári
#+TITLE: The Programmable Data Plane: Reading List
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
#+HTML_HEAD: <script src="https://ajax.googleapis.com/ajax/libs/jquery/2.1.3/jquery.min.js"></script>
#+HTML_HEAD: <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.4/js/bootstrap.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="https://www.pirilampo.org/styles/lib/js/jquery.stickytableheaders.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="https://www.pirilampo.org/styles/readtheorg/js/readtheorg.js"></script>
#+HTML_HEAD: <style>.example{border:0px solid; background:#ffffff; padding:0px; margin-top:0px;margin-bottom:0px;font-family:"Bitstream Vera Sans", Verdana, sans-serif;font-style: italic;}</style>
# \bibliography{./prog_data_plane.bib}
# \bibliographystyle{plain}

/See the [[https://rg0now.github.io/prog_dataplane_reading_list/README.html][HTML version]] for a nicely formatted version./

This is a reading list for students, practitioners, and researchers
interested in the general area of programmable data plane devices,
including SmartNICs, programmable middleboxes and software/hardware
switches, everything that may underlie a software-defined network. The
reading list completes the survey paper "TODO".

The reading list is organized into a rough hierarchy based on the major
topics of /Abstractions/, /Architecture/, and /Miscellanea/; note that this
hierarchy is more or less arbitrary and the purpose is just to have /some/
organization at all. The individual papers are tagged as "mustread",
"important", and "interesting" (available only in the HTML version), with
the approximate meaning "read at least these papers to get a good
understanding of the area", "papers for getting more familiar with some
sub-areas", and "interesting contributions to the field",
respectively. Just like the hierarchy, the tags are also pretty much
arbitrary and follow the subjective views of the authors; your mileage may
vary.

/Note:/ Some of the linked papers are behind paywalls. We double-checked
that all listed papers can be accessed freely by a moderate amount of
googling; we still provide the paywall links as user-provided PDFs often do
not prove overly stable over time.

* Abstractions

** Languages and Compilers

*** Low-level APIs

**** McKeown et al.: [[http://doi.acm.org/10.1145/1355734.1355746][*OpenFlow: Enabling Innovation in Campus Networks*]], /ACM SIGCOMM Comput. Commun. Rev./, 2008.
     :PROPERTIES:
     :RELEVANCE:   mustread
     :END:
THe OpenFlow whitepaper. The original idea in OpenFlow was to provide a way
for researchers to run experimental protocols in the networks they use
every day. OpenFlow is based on an Ethernet switch, with an internal
flow-table, and a standardized interface to add and remove flow entries.
This allowed, in addition to allowing researchers to evaluate their ideas
in real-world traffic settings, for OpenFlow to serve as a useful campus
component in large-scale testbeds.

**** Duncan et al.: [[https://ieeexplore.ieee.org/iel5/5166953/5166954/05167027.pdf][*packetC: Language for High Performance Packet Processing*]], /IEEE HPCC/, 2009.
     :PROPERTIES:
     :RELEVANCE:   interesting
     :END:
This paper describes a model which combines a parallel model and
heterogeneous multiprocessor implementations.  The parallel packet
processing model uses coarse-grain, SPMD parallelism to free users from
thread management and it requires the host system to locate protocol
headers in the packet before a parallel copy of the program executes.  The
packetC language abstracts and encapsulates familiar packet processing data
sets and operations into new aggregate data types and operators, e.g., for
packets, databases and searchsets. 

**** Song et al.: [[http://doi.acm.org/10.1145/2491185.2491190][*Protocol-oblivious Forwarding: Unleash the Power of SDN Through a Future-proof Forwarding Plane*]], /ACM HotSDN/, 2013.
     :PROPERTIES:
     :RELEVANCE:   important
     :END:
As an alternative to P4, Protocol-Oblivious Forwarding (POF) is presented
as a key enabler for highly flexible and programmable SDN. The goal is to
remove any dependency on protocol-specific configurations on the forwarding
elements and, in addition to P4's stateless design, enhance the data-path
with new stateful instructions to support genuine software defined
networking behavior. A generic flow instruction set (FIS) is defined to
fulfill this purpose and both hardware-based and open source software-based
prototypes are shown to demonstrate the feasibility and advantages of POF.

**** Bosshart et al.: [[http://www.sigcomm.org/sites/default/files/ccr/papers/2014/July/0000000-0000004.pdf][*P4: Programming protocol-independent packet processors*]], /ACM SIGCOMM Comput. Commun. Rev./, 2014.
     :PROPERTIES:
     :RELEVANCE:   mustread
     :END:
This seminal paper introduces P4, a high-level language for programming
protocol-independent packet processors. P4 has three goals: (1)
reconfigurability, in that programmers can change the way switches process
packets once they are deployed, (2) protocol independence, in that switches
are not tied to any specific network protocols, and (3) target
independence, in that programmers can describe packet-processing
functionality independently of the specifics of the underlying
hardware. The paper demonstrates P4 by showing configure a switch to add a
new hierarchical label.

**** Shahbaz et al.: [[http://doi.acm.org/10.1145/2774993.2775000][*The Case for an Intermediate Representation for Programmable Data Planes*]], /ACM SOSR/, 2015.
     :PROPERTIES:
     :RELEVANCE:   important
     :END:
The paper introduces NetASM, an intermediate representation for
programmable data planes. NetASM is a device-independent language that is
expressive enough to act as the target language for compilers for
high-level languages, yet low-level enough to be efficiently assembled on
various device architectures. It enables conventional compiler optimization
techniques to significantly improve the performance and resource
utilization of custom packet-processing pipelines on a variety of targets.

