README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-04-16 Mon 15:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Programmable Data Plane: Reading List</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Roberto Bifulco, Gábor Rétvári" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">The Programmable Data Plane: Reading List</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1c9416f">Abstractions</a>
<ul>
<li><a href="#orge31c179">Languages and Compilers</a>
<ul>
<li><a href="#org26a4657">Low-level APIs</a></li>
<li><a href="#org5664893">High-level Languages and Compilers</a></li>
</ul>
</li>
<li><a href="#org8b77a0c">Abstractions for Embedded State</a></li>
<li><a href="#org68e2722">Programmable Parsing and Scheduling</a></li>
</ul>
</li>
<li><a href="#org764c4fc">Programmable Switch Architectures</a>
<ul>
<li><a href="#org17dcb2e">Software Switch Architectures</a>
<ul>
<li><a href="#org38a0228">Viability of Software Switching</a></li>
<li><a href="#org39ca970">The Dataflow Graph Abstraction</a></li>
<li><a href="#org4ba6610">The Match-action Abstraction</a></li>
<li><a href="#org6f1b975">Packet I/O Libraries</a></li>
</ul>
</li>
<li><a href="#org0d73d53">Hardware Switch Architectures</a></li>
<li><a href="#orgcb0aa6e">Hybrid Hardware/Software Architectures</a></li>
</ul>
</li>
<li><a href="#org3a69e50">Miscellaneous Topics</a>
<ul>
<li><a href="#orgba4fa94">History</a></li>
<li><a href="#org51cea19">Large-scale Deployments</a></li>
<li><a href="#org29058f7">In-Network Computation</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<i>See the <a href="https://rg0now.github.io/prog_dataplane_reading_list/README.html">HTML version</a> for a nicely formatted version.</i>
</p>

<p>
This is a reading list for students, practitioners, and researchers
interested in the general area of programmable data plane devices,
including SmartNICs, programmable middleboxes and software/hardware
switches, everything that may underlie a software-defined network. The
reading list completes the survey paper "TODO".
</p>

<p>
The reading list is organized into a rough hierarchy based on the major
topics of <i>Abstractions</i>, <i>Architecture</i>, and <i>Miscellanea</i>; note that this
hierarchy is more or less arbitrary and the purpose is just to have <i>some</i>
organization at all. The individual papers are tagged as "mustread",
"important", and "interesting" (available only in the HTML version), with
the approximate meaning "read at least these papers to get a good
understanding of the area", "papers for getting more familiar with some
sub-areas", and "interesting contributions to the field",
respectively. Just like the hierarchy, the tags are also pretty much
arbitrary and follow the subjective views of the authors; your mileage may
vary.
</p>

<p>
<i>Note:</i> Some of the linked papers are behind paywalls. We double-checked
that all listed papers can be accessed freely by a moderate amount of
googling; we still provide the paywall links as user-provided PDFs often do
not prove overly stable over time.
</p>

<div id="outline-container-org1c9416f" class="outline-2">
<h2 id="org1c9416f">Abstractions</h2>
<div class="outline-text-2" id="text-org1c9416f">
</div>
<div id="outline-container-orge31c179" class="outline-3">
<h3 id="orge31c179">Languages and Compilers</h3>
<div class="outline-text-3" id="text-orge31c179">
</div>
<div id="outline-container-org26a4657" class="outline-4">
<h4 id="org26a4657">Low-level APIs</h4>
<div class="outline-text-4" id="text-org26a4657">
</div>
<ul class="org-ul">
<li><a id="org560b8f6"></a>McKeown et al.: <a href="http://doi.acm.org/10.1145/1355734.1355746"><b>OpenFlow: Enabling Innovation in Campus Networks</b></a>, <i>ACM SIGCOMM Comput. Commun. Rev.</i>, 2008.<br />
<div class="outline-text-5" id="text-org560b8f6">
<pre class="example">
RELEVANCE: mustread
</pre>
<p>
THe OpenFlow whitepaper. The original idea in OpenFlow was to provide a way
for researchers to run experimental protocols in the networks they use
every day. OpenFlow is based on an Ethernet switch, with an internal
flow-table, and a standardized interface to add and remove flow entries.
This allowed, in addition to allowing researchers to evaluate their ideas
in real-world traffic settings, for OpenFlow to serve as a useful campus
component in large-scale testbeds.
</p>
</div>
</li>

<li><a id="org803cdfc"></a>Duncan et al.: <a href="https://ieeexplore.ieee.org/iel5/5166953/5166954/05167027.pdf"><b>packetC: Language for High Performance Packet Processing</b></a>, <i>IEEE HPCC</i>, 2009.<br />
<div class="outline-text-5" id="text-org803cdfc">
<pre class="example">
RELEVANCE: interesting
</pre>
<p>
This paper describes a model which combines a parallel model and
heterogeneous multiprocessor implementations.  The parallel packet
processing model uses coarse-grain, SPMD parallelism to free users from
thread management and it requires the host system to locate protocol
headers in the packet before a parallel copy of the program executes.  The
packetC language abstracts and encapsulates familiar packet processing data
sets and operations into new aggregate data types and operators, e.g., for
packets, databases and searchsets. 
</p>
</div>
</li>

<li><a id="org6822dbd"></a>Song et al.: <a href="http://doi.acm.org/10.1145/2491185.2491190"><b>Protocol-oblivious Forwarding: Unleash the Power of SDN Through a Future-proof Forwarding Plane</b></a>, <i>ACM HotSDN</i>, 2013.<br />
<div class="outline-text-5" id="text-org6822dbd">
<pre class="example">
RELEVANCE: important
</pre>
<p>
As an alternative to P4, Protocol-Oblivious Forwarding (POF) is presented
as a key enabler for highly flexible and programmable SDN. The goal is to
remove any dependency on protocol-specific configurations on the forwarding
elements and, in addition to P4's stateless design, enhance the data-path
with new stateful instructions to support genuine software defined
networking behavior. A generic flow instruction set (FIS) is defined to
fulfill this purpose and both hardware-based and open source software-based
prototypes are shown to demonstrate the feasibility and advantages of POF.
</p>
</div>
</li>

<li><a id="org24fc87a"></a>Bosshart et al.: <a href="http://www.sigcomm.org/sites/default/files/ccr/papers/2014/July/0000000-0000004.pdf"><b>P4: Programming protocol-independent packet processors</b></a>, <i>ACM SIGCOMM Comput. Commun. Rev.</i>, 2014.<br />
<div class="outline-text-5" id="text-org24fc87a">
<pre class="example">
RELEVANCE: mustread
</pre>
<p>
This seminal paper introduces P4, a high-level language for programming
protocol-independent packet processors. P4 has three goals: (1)
reconfigurability, in that programmers can change the way switches process
packets once they are deployed, (2) protocol independence, in that switches
are not tied to any specific network protocols, and (3) target
independence, in that programmers can describe packet-processing
functionality independently of the specifics of the underlying
hardware. The paper demonstrates P4 by showing configure a switch to add a
new hierarchical label.
</p>
</div>
</li>

<li><a id="org2eaf39b"></a>Shahbaz et al.: <a href="http://doi.acm.org/10.1145/2774993.2775000"><b>The Case for an Intermediate Representation for Programmable Data Planes</b></a>, <i>ACM SOSR</i>, 2015.<br />
<div class="outline-text-5" id="text-org2eaf39b">
<pre class="example">
RELEVANCE: important
</pre>
<p>
The paper introduces NetASM, an intermediate representation for
programmable data planes. NetASM is a device-independent language that is
expressive enough to act as the target language for compilers for
high-level languages, yet low-level enough to be efficiently assembled on
various device architectures. It enables conventional compiler optimization
techniques to significantly improve the performance and resource
utilization of custom packet-processing pipelines on a variety of targets.
</p>
</div>
</li>
