README.org
**** Bifulco et al.: [[http://doi.acm.org/10.1145/2890955.2890962][*Improving SDN with InSPired Switches*]], /ACM SOSR/, 2016.
     :PROPERTIES:
     :RELEVANCE:   mustread
     :END:
The paper proposes an API for programming the generation of packets in
programmable switches, instead of forging network packets on the controller
side.  The InSP API allows a programmer to define in-switch packet
generation operations, which include the specification of triggering
conditions, packet's content and forwarding actions.

**** Choi et al.: [[https://www.cs.princeton.edu/~mshahbaz/papers/sosr17demos-pvpp.pdf][*PVPP: A Programmable Vector Packet Processor*]], /ACM SOSR/, 2017.
     :PROPERTIES:
     :RELEVANCE:   interesting
     :END:
PVPP is a data-plane program compiler from P4, a data plane DSL based on
match-action tables, to the fd.io Vector Packet Processor (VPP) software
switch, based on the packet processing node graph model. PVPP compiles a
data plane program written in P4 to VPP's internal graph
representation. 

*** High-level Languages and Compilers

**** Christopher Monsanto et al.: [[https://www.usenix.org/system/files/conference/nsdi13/nsdi13-final232.pdf][*Composing Software Defined Networks*]], /USENIX NSDI/, 2013.
     :PROPERTIES:
     :RELEVANCE:   mustread
     :END:
The paper introduces Pyretic, a novel programming language for writing
composable SDN applications using a set of high level topology and
packet-processing abstractions. Pyretic improves on Frenetic (an earlier
incarnation of a similar language) by adding support for sequential
composition, the use of topology abstractions to define what each module
can see and do with the network, and an abstract packet model that
introduces virtual fields into packets. Modular applications are written
using the static policy language NetCore, which provides primitive actions,
matching predicates, query policies, and policies.

**** Voellmy et al.: [[https://conferences.sigcomm.org/sigcomm/2013/papers/sigcomm/p87.pdf][*Maple: simplifying SDN programming using algorithmic policies*]], /ACM SIGCOMM Comput. Commun. Rev./, 2013.
     :PROPERTIES:
     :RELEVANCE:   important
     :END:
The paper presents Maple, a system that simplifies SDN programming by (1)
allowing a programmer to use a standard programming language to design an
arbitrary, centralized algorithm, to decide the behavior of an entire
network, and (2) providing an abstraction that the programmer-defined,
centralized policy runs on every packet entering a network, and hence is
oblivious to the challenge of translating a high-level policy into sets of
rules on distributed individual switches. To implement algorithmic policies
efficiently, Maple includes not only a highly-efficient multicore
scheduler, but more importantly a novel tracing runtime optimizer that can
automatically record reusable policy decisions, offload work to switches
when possible, and keep switch flow tables up-to-date by dynamically
tracing the dependency of policy decisions on packet contents as well as
the environment. 

**** Foster et al.: [[http://frenetic-lang.org/publications/overview-ieeecoms13.pdf][*Languages for software-defined networks*]], /IEEE Communications Magazine/, 2013.
     :PROPERTIES:
     :RELEVANCE:   mustread
     :END:
An easily approachable survey on higher-level abstractions for creating and
composing packet processing applications using the Frenetic framework.

**** Bonelli et al.: [[http://doi.acm.org/10.1145/2658260.2658269][*A Purely Functional Approach to Packet Processing*]], /IEEE/ACM ANCS/, 2014.
     :PROPERTIES:
     :RELEVANCE:   interesting
     :END:
The paper introduces PFQ-Lang, an extensible functional language to
process, analyze and forward packets, which allows easy development by
leveraging functional composition and allows to exploit multi-queue NICs
and multi-core architectures.

**** Lavanya Jose et al.: [[https://www.usenix.org/conference/nsdi15/technical-sessions/presentation/jose][*Compiling Packet Programs to Reconfigurable Switches*]], /USENIX NSDI/, 2015.
     :PROPERTIES:
     :RELEVANCE:   mustread
     :END:
Seminal paper exploring the design of a compiler for programmable switching
chips, in particular how to map logical lookup tables to physical tables
while meeting data and control dependencies in the program. A Integer
Linear Programming (ILP) and greedy approach is presented to generate
solutions optimized for latency, pipeline occupancy, or power
consumption. The authors show benchmarks from real production networks to
two different programmable switch architectures: RMT and Intel’s FlexPipe.

**** Firestone et al.: [[https://www.usenix.org/system/files/conference/nsdi17/nsdi17-firestone.pdf][*VFP: A Virtual Switch Platform for Host Sdn in the Public Cloud*]], /USENIX NSDI/, 2017.
     :PROPERTIES:
     :RELEVANCE:   important
     :END:
The paper presents the Virtual Filtering Platform (VFP), a programmable
virtual switch that powers Microsoft Azure, a large public cloud. VFP
includes support for multiple independent network controllers, policy based
on connections rather than only on packets, efficient caching and
classification algorithms for performance, and efficient offload of flow
policy to programmable NICs. The paper presents the design of VFP and its
API, its flow language and compiler used for flow processing, performance
results, and experiences deploying and using VFP in Azure over several
years.

**** Wang et al.: [[https://www.cs.cornell.edu/~jnfoster/papers/p4fpga.pdf][*P4FPGA: A Rapid Prototyping Framework for P4*]], /ACM SOSR/, 2017.
     :PROPERTIES:
     :RELEVANCE:   interesting
     :END:
P4FPGA is a tool for developing and evaluating data plane applications. It
is both an open-source compiler and runtime; the compiler in turn extends
the P4.org reference compiler with a custom backend that generates FPGA
code. By combining high-level programming abstractions offered by P4 with a
flexible and powerful hardware target, P4FPGA may allow developers to
rapidly prototype and deploy new data plane applications.

** Abstractions for Embedded State

**** Verdú et al.: [[http://citeseerx.ist.psu.edu/viewdoc/download;jsessionid=ED2CCB19D8967081D9DE927A7AB43614?doi=10.1.1.482.5955&rep=rep1&type=pdf][*Workload Characterization of Stateful Networking Applications*]], /IEEE HPC/, 2008.
     :PROPERTIES:
     :RELEVANCE:   important
     :END:
This paper presents the first workload characterization of stateful
networking applications. The analysis emphasizes the study of data cache
behaviour, but discusses branch prediction, instruction distribution,
etc. Another important contribution is the study of the state categories of
different networking applications. 

