README.html

<li><a id="org2300d09"></a>Bifulco et al.: <a href="http://doi.acm.org/10.1145/2890955.2890962"><b>Improving SDN with InSPired Switches</b></a>, <i>ACM SOSR</i>, 2016.<br />
<div class="outline-text-5" id="text-org2300d09">
<pre class="example">
RELEVANCE: mustread
</pre>
<p>
The paper proposes an API for programming the generation of packets in
programmable switches, instead of forging network packets on the controller
side.  The InSP API allows a programmer to define in-switch packet
generation operations, which include the specification of triggering
conditions, packet's content and forwarding actions.
</p>
</div>
</li>

<li><a id="orgf78f455"></a>Choi et al.: <a href="https://www.cs.princeton.edu/~mshahbaz/papers/sosr17demos-pvpp.pdf"><b>PVPP: A Programmable Vector Packet Processor</b></a>, <i>ACM SOSR</i>, 2017.<br />
<div class="outline-text-5" id="text-orgf78f455">
<pre class="example">
RELEVANCE: interesting
</pre>
<p>
PVPP is a data-plane program compiler from P4, a data plane DSL based on
match-action tables, to the fd.io Vector Packet Processor (VPP) software
switch, based on the packet processing node graph model. PVPP compiles a
data plane program written in P4 to VPP's internal graph
representation. 
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-org5664893" class="outline-4">
<h4 id="org5664893">High-level Languages and Compilers</h4>
<div class="outline-text-4" id="text-org5664893">
</div>
<ul class="org-ul">
<li><a id="org194c518"></a>Christopher Monsanto et al.: <a href="https://www.usenix.org/system/files/conference/nsdi13/nsdi13-final232.pdf"><b>Composing Software Defined Networks</b></a>, <i>USENIX NSDI</i>, 2013.<br />
<div class="outline-text-5" id="text-org194c518">
<pre class="example">
RELEVANCE: mustread
</pre>
<p>
The paper introduces Pyretic, a novel programming language for writing
composable SDN applications using a set of high level topology and
packet-processing abstractions. Pyretic improves on Frenetic (an earlier
incarnation of a similar language) by adding support for sequential
composition, the use of topology abstractions to define what each module
can see and do with the network, and an abstract packet model that
introduces virtual fields into packets. Modular applications are written
using the static policy language NetCore, which provides primitive actions,
matching predicates, query policies, and policies.
</p>
</div>
</li>

<li><a id="org74fca40"></a>Voellmy et al.: <a href="https://conferences.sigcomm.org/sigcomm/2013/papers/sigcomm/p87.pdf"><b>Maple: simplifying SDN programming using algorithmic policies</b></a>, <i>ACM SIGCOMM Comput. Commun. Rev.</i>, 2013.<br />
<div class="outline-text-5" id="text-org74fca40">
<pre class="example">
RELEVANCE: important
</pre>
<p>
The paper presents Maple, a system that simplifies SDN programming by (1)
allowing a programmer to use a standard programming language to design an
arbitrary, centralized algorithm, to decide the behavior of an entire
network, and (2) providing an abstraction that the programmer-defined,
centralized policy runs on every packet entering a network, and hence is
oblivious to the challenge of translating a high-level policy into sets of
rules on distributed individual switches. To implement algorithmic policies
efficiently, Maple includes not only a highly-efficient multicore
scheduler, but more importantly a novel tracing runtime optimizer that can
automatically record reusable policy decisions, offload work to switches
when possible, and keep switch flow tables up-to-date by dynamically
tracing the dependency of policy decisions on packet contents as well as
the environment. 
</p>
</div>
</li>

<li><a id="orga387409"></a>Foster et al.: <a href="http://frenetic-lang.org/publications/overview-ieeecoms13.pdf"><b>Languages for software-defined networks</b></a>, <i>IEEE Communications Magazine</i>, 2013.<br />
<div class="outline-text-5" id="text-orga387409">
<pre class="example">
RELEVANCE: mustread
</pre>
<p>
An easily approachable survey on higher-level abstractions for creating and
composing packet processing applications using the Frenetic framework.
</p>
</div>
</li>

<li><a id="org8ff5a55"></a>Bonelli et al.: <a href="http://doi.acm.org/10.1145/2658260.2658269"><b>A Purely Functional Approach to Packet Processing</b></a>, <i>IEEE/ACM ANCS</i>, 2014.<br />
<div class="outline-text-5" id="text-org8ff5a55">
<pre class="example">
RELEVANCE: interesting
</pre>
<p>
The paper introduces PFQ-Lang, an extensible functional language to
process, analyze and forward packets, which allows easy development by
leveraging functional composition and allows to exploit multi-queue NICs
and multi-core architectures.
</p>
</div>
</li>

<li><a id="orgaa84a36"></a>Lavanya Jose et al.: <a href="https://www.usenix.org/conference/nsdi15/technical-sessions/presentation/jose"><b>Compiling Packet Programs to Reconfigurable Switches</b></a>, <i>USENIX NSDI</i>, 2015.<br />
<div class="outline-text-5" id="text-orgaa84a36">
<pre class="example">
RELEVANCE: mustread
</pre>
<p>
Seminal paper exploring the design of a compiler for programmable switching
chips, in particular how to map logical lookup tables to physical tables
while meeting data and control dependencies in the program. A Integer
Linear Programming (ILP) and greedy approach is presented to generate
solutions optimized for latency, pipeline occupancy, or power
consumption. The authors show benchmarks from real production networks to
two different programmable switch architectures: RMT and Intel’s FlexPipe.
</p>
</div>
</li>

<li><a id="org0086447"></a>Firestone et al.: <a href="https://www.usenix.org/system/files/conference/nsdi17/nsdi17-firestone.pdf"><b>VFP: A Virtual Switch Platform for Host Sdn in the Public Cloud</b></a>, <i>USENIX NSDI</i>, 2017.<br />
<div class="outline-text-5" id="text-org0086447">
<pre class="example">
RELEVANCE: important
</pre>
<p>
The paper presents the Virtual Filtering Platform (VFP), a programmable
virtual switch that powers Microsoft Azure, a large public cloud. VFP
includes support for multiple independent network controllers, policy based
on connections rather than only on packets, efficient caching and
classification algorithms for performance, and efficient offload of flow
policy to programmable NICs. The paper presents the design of VFP and its
API, its flow language and compiler used for flow processing, performance
results, and experiences deploying and using VFP in Azure over several
years.
</p>
</div>
</li>

<li><a id="org8cdd3d9"></a>Wang et al.: <a href="https://www.cs.cornell.edu/~jnfoster/papers/p4fpga.pdf"><b>P4FPGA: A Rapid Prototyping Framework for P4</b></a>, <i>ACM SOSR</i>, 2017.<br />
<div class="outline-text-5" id="text-org8cdd3d9">
<pre class="example">
RELEVANCE: interesting
</pre>
<p>
P4FPGA is a tool for developing and evaluating data plane applications. It
is both an open-source compiler and runtime; the compiler in turn extends
the P4.org reference compiler with a custom backend that generates FPGA
code. By combining high-level programming abstractions offered by P4 with a
flexible and powerful hardware target, P4FPGA may allow developers to
rapidly prototype and deploy new data plane applications.
</p>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-org8b77a0c" class="outline-3">
<h3 id="org8b77a0c">Abstractions for Embedded State</h3>
<div class="outline-text-3" id="text-org8b77a0c">
</div>
<ul class="org-ul">
<li><a id="orgf399370"></a>Verdú et al.: <a href="http://citeseerx.ist.psu.edu/viewdoc/download;jsessionid=ED2CCB19D8967081D9DE927A7AB43614?doi=10.1.1.482.5955&amp;rep=rep1&amp;type=pdf"><b>Workload Characterization of Stateful Networking Applications</b></a>, <i>IEEE HPC</i>, 2008.<br />
<div class="outline-text-5" id="text-orgf399370">
<pre class="example">
RELEVANCE: important
</pre>
<p>
This paper presents the first workload characterization of stateful
networking applications. The analysis emphasizes the study of data cache
behaviour, but discusses branch prediction, instruction distribution,
etc. Another important contribution is the study of the state categories of
different networking applications. 
</p>
</div>
</li>
