README.org
**** Bianchi et al.: [[http://doi.acm.org/10.1145/2602204.2602211][*OpenState: Programming Platform-independent Stateful Openflow Applications Inside the Switch*]], /ACM SIGCOMM Comput. Commun. Rev./, 2014.
     :PROPERTIES:
     :RELEVANCE:   mustread
     :END:
The paper tackles the challenge to devise a stateful data plane programming
abstraction (versus the stateless OpenFlow match/action table abstraction)
which still entails high performance and remains consistent with vendors'
preference for closed platforms. The authors posit that a promising answer
revolves around the usage of extended finite state machines, as an
extension (super-set) of the OpenFlow match/action abstraction, turn the
proposed abstraction into an actual table-based API, and we show how it can
be supported by (mostly) reusing core primitives already implemented in
OpenFlow devices.

**** Moshref et al.: [[http://doi.acm.org/10.1145/2620728.2620729][*Flow-level State Transition As a New Switch Primitive for SDN*]], /ACM HotSDN/, 2014.
     :PROPERTIES:
     :RELEVANCE:   interesting
     :END:
The paper proposes FAST (Flow-level State Transitions) as a new switch
primitive for software-defined networks. With FAST, the controller simply
preinstalls a state machine and switches can automatically record flow
state transitions by matching incoming packets to installed filters. FAST
can support a variety of dynamic applications, and can be readily
implemented with commodity switch components and software switches.

**** Arashloo et al.: [[http://doi.acm.org/10.1145/2934872.2934892][*SNAP: Stateful Network-Wide Abstractions for Packet Processing*]], /ACM SIGCOMM/, 2016.
     :PROPERTIES:
     :RELEVANCE:   important
     :END:
SNAP offers a simpler "centralized" stateful programming model on top of
the simple match-action paradigm offered by OpenFlow.  SNAP programs are
developed on a one-big-switch abstraction and may contain reads and writes
to global, persistent arrays, allowing programmers to implement a broad
range of stateful applications. The SNAP compiler then distributes, places,
and optimizes access to these stateful arrays, discovering read/write
dependencies and translating one-big-switch programs into an efficient
internal representation based on a novel variant of binary decision
diagrams.

**** Sivaraman et al.: [[http://doi.acm.org/10.1145/2934872.2934900][*Packet Transactions: High-Level Programming for Line-Rate Switches*]], /ACM SIGCOMM/, 2016.
     :PROPERTIES:
     :RELEVANCE:   important
     :END:
This paper shows how to program data-plane algorithms in a high-level
language and compile those programs into low-level microcode that can run
on programmable line-rate switching chips. The key challenge is that many
data-plane algorithms create and modify algorithmic state. To achieve
line-rate programmability for stateful algorithms, the paper introduces the
notion of a packet transaction: a sequential packet-processing code block
that is atomic and isolated from other such code blocks. The idea is
developed in Domino, a C-like imperative language to express data-plane
algorithms, and many examples are shown that can be run at line rate with
modest estimated chip-area overhead.

**** Giuseppe Bianchi et al.: [[http://arxiv.org/abs/1605.01977][*Open Packet Processor: a programmable architecture for wire speed platform-independent stateful in-network processing*]], /unpublished manuscript/, 2016.
     :PROPERTIES:
     :RELEVANCE:   interesting
     :END:
This paper aims at contributing to the debate on how to bring
programmability of stateful packet processing tasks inside the network
switches, while retaining platform independency. The proposed approach,
named "Open Packet Processor" (OPP), shows the viability of eXtended Finite
State Machines (XFSM) as low-level data plane programming
abstraction. Platform independence is accomplished by decoupling the
implementation of hardware primitives from their usage by an application
formally described via an abstract XFSM.

**** Luo et al.: [[http://doi.acm.org/10.1145/3050220.3050233][*Swing State: Consistent Updates for Stateful and Programmable Data Planes*]], /ACM SOSR/, 2017.
     :PROPERTIES:
     :RELEVANCE:   interesting
     :END:
The paper presents Swing State, a general state-management framework and
runtime system supporting consistent state migration in stateful data
planes. The key insight is to perform state migration entirely within the
data plane by piggybacking state updates on live traffic. To minimize the
overhead, Swing State only migrates the states that cannot be safely
reconstructed at the destination switch. A prototype of Swing State for P4
is also described.

**** Dargahi et al.: [[https://doi.org/10.1109/COMST.2017.2689819][*A Survey on the Security of Stateful SDN Data Planes*]], /IEEE Communications Surveys Tutorials/, 2017.
     :PROPERTIES:
     :RELEVANCE:   important
     :END:
The paper provides the reader with a background on stateful SDN data plane
proposals, focusing on the security implications that data plane
programmability brings about, identifies potential attack scenarios, and
highlights possible vulnerabilities specific to stateful in-switch
processing, including denial of service and saturation attacks.

**** Murad Kablan et al.: [[https://www.usenix.org/conference/nsdi17/technical-sessions/presentation/kablan][*Stateless Network Functions: Breaking the Tight Coupling of State and Processing*]], /USENIX NSDI 17/, 2017.
     :PROPERTIES:
     :RELEVANCE:   mustread
     :END:
The paper presents Stateless Network Functions, a new architecture for
network functions virtualization, where the existing design of network
functions is decomposed into a stateless processing component along with a
data-store layer. The StatelessNF processing instances are architected
around efficient pipelines utilizing DPDK for high performance network I/O,
packaged as Docker containers for easy deployment, and a data store
interface optimized based on the expected request patterns to efficiently
access a RAMCloud-based data store. A network-wide orchestrator monitors
the instances for load and failure, manages instances to scale and provide
resilience, and leverages an OpenFlow-based network to direct traffic to
instances. 

** Programmable Parsing and Scheduling

**** Gibb et al.: [[https://doi.org/10.1109/ANCS.2013.6665172][*Design principles for packet parsers*]], /IEEE/ACM ANCS/, 2013.
     :PROPERTIES:
     :RELEVANCE:   important
     :END:
The paper presents an interesting view on parser design and the trade-offs
between different designs, asking whether it is better to design one fast
parser or several slow parsers, what are the costs of making the parser
reconfigurable in the field, and what design decisions most impact power
and area. The paper describes trade-offs in parser design, identifies
design principles for switch and router architects, and describes a parser
generator that outputs synthesizable Verilog that is available for
download.

