README.org
**** Radhika Mittal et al.: [[https://www.usenix.org/conference/nsdi16/technical-sessions/presentation/mittal][*Universal Packet Scheduling*]], /USENIX NSDI/, 2016.
     :PROPERTIES:
     :RELEVANCE:   interesting
     :END:
The addresses a seemingly simple question: Is there a universal packet
scheduling algorithm? It turns out that in general the answer is "no";
however, the authors manage to show that the classical Least Slack Time
First (LSTF) scheduling algorithm comes closest to being universal and it
can closely replay a wide range of scheduling algorithms. LSTF is evaluated
as to whether in practice it can meet various network-wide objectives; the
authors find that LSTF performs comparable to the state-of-the-art for each
of performance metric. 

**** Sivaraman et al.: [[http://doi.acm.org/10.1145/2934872.2934899][*Programmable Packet Scheduling at Line Rate*]], /ACM SIGCOMM/, 2016.
     :PROPERTIES:
     :RELEVANCE:   important
     :END:
Similarly to the "Universal Packet Scheduling" paper, this paper presents
another design for a programmable packet scheduler, which allows scheduling
algorithms, potentially algorithms that are unknown today, to be programmed
into a switch without requiring hardware redesign.  The design uses the
property that scheduling algorithms make two decisions, in what order to
schedule packets and when to schedule them, and exploits that in many
scheduling algorithms definitive decisions on these two questions can be
made when packets are enqueued. The resultant design uses a single
abstraction: the push-in first-out queue (PIFO), a priority queue that
maintains the scheduling order or time.

**** Sivaraman et al.: [[http://doi.acm.org/10.1145/2535771.2535796][*No Silver Bullet: Extending SDN to the Data Plane*]], /ACM HotNets/, 2013.
     :PROPERTIES:
     :RELEVANCE:   interesting
     :END:
Instead of going with a universal scheduler, the authors argue that
Software-Defined Networking must be extended to control the fast-path
scheduling and queueing behavior of a switch. To this end, they propose
adding a small FPGA to switches, and synthesize, place, and route hardware
implementations for CoDel and RED.

* Programmable Switch Architectures

** Software Switch Architectures

*** Viability of Software Switching

**** Egi et al.: [[http://doi.acm.org/10.1145/1544012.1544032][*Towards High Performance Virtual Routers on Commodity Hardware*]], /ACM CoNEXT/, 2008.
     :PROPERTIES:
     :RELEVANCE:   interesting
     :END:
The paper is the first to study the performance limitations when building
both software routers and software virtual routers on commodity CPU
platforms. The authors observe that the fundamental performance bottleneck
is the memory system, and that through careful mapping of tasks to CPU
cores one can achieve very high forwarding rates. The authors also identify
principles for the construction of high-performance software router systems
on commodity hardware.

**** Greenhalgh et al.: [[http://www.sigcomm.org/sites/default/files/ccr/papers/2009/April/1517480-1517484.pdf][*Flow Processing and the Rise of Commodity Network Hardware*]], /SIGCOMM Comput. Commun. Rev./, 2009.
     :PROPERTIES:
     :RELEVANCE:   mustread
     :END:
The paper introduces the FlowStream switch architecture, which enables flow
processing and forwarding at unprecedented flexibility and low cost by
consolidating middlebox functionality, such as load balancing, packet
inspection and intrusion detection, and commodity switch technologies,
offering the possibility to control the switching of flows in a
fine-grained manner, into a single integrated package deployed on commodity
hardware.

**** Dobrescu et al.: [[http://kfall.net/ucbpage/papers/sosp09.pdf][*RouteBricks: exploiting parallelism to scale software routers*]], /ACM SOSP/, 2009.
     :PROPERTIES:
     :RELEVANCE:   interesting
     :END:
RouteBricks is concerned with enabling high-speed parallel processing in
software routers, using a software router architecture that parallelizes
router functionality both across multiple servers and across multiple cores
within a single server. RouteBricks adopts a fully programmable Click/Linux
environment and is built entirely from off-the-shelf, general-purpose
server hardware.

*** The Dataflow Graph Abstraction

**** Morris et al.: [[https://pdos.csail.mit.edu/papers/click:tocs00/paper.pdf][*The Click modular router*]], /ACM Trans. on Computer Systems/, 2000.
     :PROPERTIES:
     :RELEVANCE:   mustread
     :END:
Introduces Click, a software architecture for building flexible and
configurable routers from packet processing modules implementing simple
router functions like packet classification, queuing, scheduling, organized
into a directed graph with packet processing modules at the vertices;
packets flow along the edges of the graph.

**** Sun et al.: [[https://dl.acm.org/citation.cfm?id=2537861][*Fast and Flexible: Parallel Packet Processing with GPUs and Click*]], /IEEE/ACM ANCS/, 2013.
     :PROPERTIES:
     :RELEVANCE:   important
     :END:
The paper introduces Snap, a framework for packet processing that exploits
the parallelism available on modern GPUs, while remaining flexible, with
packet processing tasks implemented as simple modular elements that are
composed to build fully functional routers and switches. Snap is based on
the Click modular router, which it extends by adding new architectural
features that support batched packet processing, memory structures
optimized for offloading to coprocessors, and asynchronous scheduling with
in-order completion. 

**** Sangjin Han et al.: [[http://www.eecs.berkeley.edu/Pubs/TechRpts/2015/EECS-2015-155.pdf][*SoftNIC: A Software NIC to Augment Hardware*]], /unpublished manuscript/, 2015.
     :PROPERTIES:
     :RELEVANCE:   important
     :END:
SoftNIC is a hybrid software-hardware architecture to bridge the gap
between limited hardware capabilities and ever changing user
demands. SoftNIC provides a programmable platform that allows applications
to leverage NIC features implemented in software and hardware, without
sacrificing performance. This paper serves the foundation for the BESS
software switch.

**** Sangjin Han et al.: [[http://span.cs.berkeley.edu/bess.html][*Berkeley Extensible Software Switch*]], /project website/, 2015.
     :PROPERTIES:
     :RELEVANCE:   important
     :END:
BESS is the Berkeley Extensible Software Switch developed at the University
of California, Berkeley and at Nefeli Networks. BESS is heavily inspired by
the Click modular router, representing a packet processing pipeline as a
dataflow (multi)graph that consists of modules, each of which implements a
NIC feature, and ports that act as sources and sinks for this
pipeline. Packets received at a port flow through the pipeline to another
port, and each module in the pipeline performs module-specific operations
on packets. 

