README.html

<li><a id="org5aa397b"></a>Radhika Mittal et al.: <a href="https://www.usenix.org/conference/nsdi16/technical-sessions/presentation/mittal"><b>Universal Packet Scheduling</b></a>, <i>USENIX NSDI</i>, 2016.<br />
<div class="outline-text-5" id="text-org5aa397b">
<pre class="example">
RELEVANCE: interesting
</pre>
<p>
The addresses a seemingly simple question: Is there a universal packet
scheduling algorithm? It turns out that in general the answer is "no";
however, the authors manage to show that the classical Least Slack Time
First (LSTF) scheduling algorithm comes closest to being universal and it
can closely replay a wide range of scheduling algorithms. LSTF is evaluated
as to whether in practice it can meet various network-wide objectives; the
authors find that LSTF performs comparable to the state-of-the-art for each
of performance metric. 
</p>
</div>
</li>

<li><a id="org10f8d5a"></a>Sivaraman et al.: <a href="http://doi.acm.org/10.1145/2934872.2934899"><b>Programmable Packet Scheduling at Line Rate</b></a>, <i>ACM SIGCOMM</i>, 2016.<br />
<div class="outline-text-5" id="text-org10f8d5a">
<pre class="example">
RELEVANCE: important
</pre>
<p>
Similarly to the "Universal Packet Scheduling" paper, this paper presents
another design for a programmable packet scheduler, which allows scheduling
algorithms, potentially algorithms that are unknown today, to be programmed
into a switch without requiring hardware redesign.  The design uses the
property that scheduling algorithms make two decisions, in what order to
schedule packets and when to schedule them, and exploits that in many
scheduling algorithms definitive decisions on these two questions can be
made when packets are enqueued. The resultant design uses a single
abstraction: the push-in first-out queue (PIFO), a priority queue that
maintains the scheduling order or time.
</p>
</div>
</li>

<li><a id="org7a05088"></a>Sivaraman et al.: <a href="http://doi.acm.org/10.1145/2535771.2535796"><b>No Silver Bullet: Extending SDN to the Data Plane</b></a>, <i>ACM HotNets</i>, 2013.<br />
<div class="outline-text-5" id="text-org7a05088">
<pre class="example">
RELEVANCE: interesting
</pre>
<p>
Instead of going with a universal scheduler, the authors argue that
Software-Defined Networking must be extended to control the fast-path
scheduling and queueing behavior of a switch. To this end, they propose
adding a small FPGA to switches, and synthesize, place, and route hardware
implementations for CoDel and RED.
</p>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-org764c4fc" class="outline-2">
<h2 id="org764c4fc">Programmable Switch Architectures</h2>
<div class="outline-text-2" id="text-org764c4fc">
</div>
<div id="outline-container-org17dcb2e" class="outline-3">
<h3 id="org17dcb2e">Software Switch Architectures</h3>
<div class="outline-text-3" id="text-org17dcb2e">
</div>
<div id="outline-container-org38a0228" class="outline-4">
<h4 id="org38a0228">Viability of Software Switching</h4>
<div class="outline-text-4" id="text-org38a0228">
</div>
<ul class="org-ul">
<li><a id="org202a8a7"></a>Egi et al.: <a href="http://doi.acm.org/10.1145/1544012.1544032"><b>Towards High Performance Virtual Routers on Commodity Hardware</b></a>, <i>ACM CoNEXT</i>, 2008.<br />
<div class="outline-text-5" id="text-org202a8a7">
<pre class="example">
RELEVANCE: interesting
</pre>
<p>
The paper is the first to study the performance limitations when building
both software routers and software virtual routers on commodity CPU
platforms. The authors observe that the fundamental performance bottleneck
is the memory system, and that through careful mapping of tasks to CPU
cores one can achieve very high forwarding rates. The authors also identify
principles for the construction of high-performance software router systems
on commodity hardware.
</p>
</div>
</li>

<li><a id="org734171a"></a>Greenhalgh et al.: <a href="http://www.sigcomm.org/sites/default/files/ccr/papers/2009/April/1517480-1517484.pdf"><b>Flow Processing and the Rise of Commodity Network Hardware</b></a>, <i>SIGCOMM Comput. Commun. Rev.</i>, 2009.<br />
<div class="outline-text-5" id="text-org734171a">
<pre class="example">
RELEVANCE: mustread
</pre>
<p>
The paper introduces the FlowStream switch architecture, which enables flow
processing and forwarding at unprecedented flexibility and low cost by
consolidating middlebox functionality, such as load balancing, packet
inspection and intrusion detection, and commodity switch technologies,
offering the possibility to control the switching of flows in a
fine-grained manner, into a single integrated package deployed on commodity
hardware.
</p>
</div>
</li>

<li><a id="org5c5f3af"></a>Dobrescu et al.: <a href="http://kfall.net/ucbpage/papers/sosp09.pdf"><b>RouteBricks: exploiting parallelism to scale software routers</b></a>, <i>ACM SOSP</i>, 2009.<br />
<div class="outline-text-5" id="text-org5c5f3af">
<pre class="example">
RELEVANCE: interesting
</pre>
<p>
RouteBricks is concerned with enabling high-speed parallel processing in
software routers, using a software router architecture that parallelizes
router functionality both across multiple servers and across multiple cores
within a single server. RouteBricks adopts a fully programmable Click/Linux
environment and is built entirely from off-the-shelf, general-purpose
server hardware.
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-org39ca970" class="outline-4">
<h4 id="org39ca970">The Dataflow Graph Abstraction</h4>
<div class="outline-text-4" id="text-org39ca970">
</div>
<ul class="org-ul">
<li><a id="org896e0d2"></a>Morris et al.: <a href="https://pdos.csail.mit.edu/papers/click:tocs00/paper.pdf"><b>The Click modular router</b></a>, <i>ACM Trans. on Computer Systems</i>, 2000.<br />
<div class="outline-text-5" id="text-org896e0d2">
<pre class="example">
RELEVANCE: mustread
</pre>
<p>
Introduces Click, a software architecture for building flexible and
configurable routers from packet processing modules implementing simple
router functions like packet classification, queuing, scheduling, organized
into a directed graph with packet processing modules at the vertices;
packets flow along the edges of the graph.
</p>
</div>
</li>

<li><a id="orgf401a4d"></a>Sun et al.: <a href="https://dl.acm.org/citation.cfm?id=2537861"><b>Fast and Flexible: Parallel Packet Processing with GPUs and Click</b></a>, <i>IEEE/ACM ANCS</i>, 2013.<br />
<div class="outline-text-5" id="text-orgf401a4d">
<pre class="example">
RELEVANCE: important
</pre>
<p>
The paper introduces Snap, a framework for packet processing that exploits
the parallelism available on modern GPUs, while remaining flexible, with
packet processing tasks implemented as simple modular elements that are
composed to build fully functional routers and switches. Snap is based on
the Click modular router, which it extends by adding new architectural
features that support batched packet processing, memory structures
optimized for offloading to coprocessors, and asynchronous scheduling with
in-order completion. 
</p>
</div>
</li>

<li><a id="org0eb77f8"></a>Sangjin Han et al.: <a href="http://www.eecs.berkeley.edu/Pubs/TechRpts/2015/EECS-2015-155.pdf"><b>SoftNIC: A Software NIC to Augment Hardware</b></a>, <i>unpublished manuscript</i>, 2015.<br />
<div class="outline-text-5" id="text-org0eb77f8">
<pre class="example">
RELEVANCE: important
</pre>
<p>
SoftNIC is a hybrid software-hardware architecture to bridge the gap
between limited hardware capabilities and ever changing user
demands. SoftNIC provides a programmable platform that allows applications
to leverage NIC features implemented in software and hardware, without
sacrificing performance. This paper serves the foundation for the BESS
software switch.
</p>
</div>
</li>

<li><a id="org868c126"></a>Sangjin Han et al.: <a href="http://span.cs.berkeley.edu/bess.html"><b>Berkeley Extensible Software Switch</b></a>, <i>project website</i>, 2015.<br />
<div class="outline-text-5" id="text-org868c126">
<pre class="example">
RELEVANCE: important
</pre>
<p>
BESS is the Berkeley Extensible Software Switch developed at the University
of California, Berkeley and at Nefeli Networks. BESS is heavily inspired by
the Click modular router, representing a packet processing pipeline as a
dataflow (multi)graph that consists of modules, each of which implements a
NIC feature, and ports that act as sources and sinks for this
pipeline. Packets received at a port flow through the pipeline to another
port, and each module in the pipeline performs module-specific operations
on packets. 
</p>
</div>
</li>
