README.org
**** Honda et al.: [[http://doi.acm.org/10.1145/2774993.2775065][*mSwitch: A Highly-scalable, Modular Software Switch*]], /ACM SOSR/, 2015.
     :PROPERTIES:
     :RELEVANCE:   interesting
     :END:
The authors make the observation that it is difficult to simultaneously
provide high packet rates, high throughput, low CPU usage, high port
density and a flexible data plane in a same architecture. A new
architecture called mSwitch is proposed and four distinct modules are
implemented on top: a learning bridge, an accelerated Open vSwitch module,
a protocol demultiplexer for userspace protocol stacks, and a filtering
module that can direct packets to virtualized middleboxes.

**** Aurojit Panda et al.: [[https://www.usenix.org/system/files/conference/osdi16/osdi16-panda.pdf][*NetBricks: Taking the V out of NFV*]], /USENIX OSDI/, 2016.
     :PROPERTIES:
     :RELEVANCE:   interesting
     :END:
NetBricks is an NFV framework adopting the "graph-based" pipeline
abstraction and embracing type checking and safe runtimes to provide
isolation efficiently in software, providing the same memory isolation as
containers and VMs without incurring the same performance penalties. The
new isolation technique is called zero-copy software isolation.

*** The Match-action Abstraction

**** Ben Pfaff et al.: [[https://www.usenix.org/conference/nsdi15/technical-sessions/presentation/pfaff][*The Design and Implementation of Open vSwitch*]], /USENIX NSDI/, 2015.
     :PROPERTIES:
     :RELEVANCE:   mustread
     :END:
The paper describes the design and implementation of Open vSwitch, a
multi-layer, open source virtual switch. The design document details the
advanced flow classification and caching techniques that Open vSwitch uses
to optimize its operations and conserve hypervisor resources.

**** Shahbaz et al.: [[http://doi.acm.org/10.1145/2934872.2934886][*PISCES: A Programmable, Protocol-Independent Software Switch*]], /ACM SIGCOMM/, 2016.
     :PROPERTIES:
     :RELEVANCE:   interesting
     :END:
PISCES is a software switch derived from Open vSwitch (OVS), a hypervisor
switch whose behavior is customized using P4. PISCES is not hard-wired to
specific protocols; this independence makes it easy to add new
features. The paper also shows how the compiler can analyze the high-level
P4 specification to optimize forwarding performance; the evaluations show
that PISCES performs comparably to OVS but PISCES programs are about 40
times shorter than equivalent OVS source code.

**** Ethan Jackson et al.: [[https://www.usenix.org/conference/atc16/technical-sessions/presentation/jackson][*SoftFlow: A Middlebox Architecture for Open vSwitch*]], /USENIX ATC/, 2016.
     :PROPERTIES:
     :RELEVANCE:   interesting
     :END:
The paper presents SoftFlow, an extension to Open vSwitch that seamlessly
integrates middlebox functionality while maintaining the familiar OpenFlow
forwarding model and performing significantly better than alternative
techniques for middlebox integration.

**** Molnár et al.: [[http://doi.acm.org/10.1145/2934872.2934887][*Dataplane Specialization for High-performance OpenFlow Software Switching*]], /ACM SIGCOMM/, 2016.
     :PROPERTIES:
     :RELEVANCE:   mustread
     :END:
The authors argue that, instead of enforcing the same universal fast-path
semantics to all OpenFlow applications and optimizing for the common case,
as it is done in Open vSwitch, a programmable software switch should rather
automatically specialize its dataplane piecemeal with respect to the
configured workload. Tyey introduce ESwitch, a switch architecture that
uses on-the-fly template-based code generation to compile any OpenFlow
pipeline into efficient machine code, which can then be readily used as the
switch fast-path, delivering superior packet processing speed, improved
latency and CPU scalability, and predictable performance.

**** Rétvári et al.: [[https://conferences.sigcomm.org/sigcomm/2017/files/program-netpl/sigcomm17netpl-paper4.pdf][*Dynamic Compilation and Optimization of Packet Processing Programs*]], /ACM SIGCOMM NetPL/, 2017.
     :PROPERTIES:
     :RELEVANCE:   interesting
     :END:
The paper makes the observation that data-plane compilation is
fundamentally statically, i.e., the input of the compiler is a fixed
description of the forwarding plane semantics and the output is code that
can accommodate any packet processing behavior set by the controller at
runtime. The authors advocate a dynamic approach to data plane compilation
instead, where not just the semantics but the intended behavior is also
also input to the compiler, opening the door to a handful of runtime
optimization opportunities that can be leveraged to improve the performance
of custom-compiled datapaths beyond what is possible in a static setting.

*** Packet I/O Libraries

**** Rizzo et al.: [[https://www.usenix.org/system/files/conference/atc12/atc12-final186.pdf][*Netmap: a novel framework for fast packet I/O*]], /USENIX ATC/, 2012.
     :PROPERTIES:
     :RELEVANCE:   important
     :END:
Netmap is a framework that enables commodity operating systems to
handle the millions of packets per seconds, without requiring custom
hardware or changes to applications.  The idea is to eliminate
inefficiencies in OSes' standard packet processing datapaths: per-packet
dynamic memory allocations are removed by preallocating resources, system
call overheads are amortized over large I/O batches, and memory copies are
eliminated by sharing buffers and metadata between kernel and userspace,
while still protecting access to device registers and other kernel memory
areas.

**** Intel et al.: [[http://dpdk.org][*Intel DPDK: Data Plane Development Kit*]], /project website/, 2016.
     :PROPERTIES:
     :RELEVANCE:   important
     :END:
DPDK is a set of libraries and drivers for fast packet processing,
including a multicore framework, huge page memory, ring buffers, poll-mode
drivers for networking I/O, crypto and eventdev, etc.  DPDK can be used to
receive and send packets within the minimum number of CPU cycles (usually
less than 80 cycles), develop fast packet capture algorithms (like
=tcpdump=), and run third-party fast path stacks.

**** fd.io: [[https://fd.io][*The Fast Data Project*]], /project website/, 2016.
     :PROPERTIES:
     :RELEVANCE:   interesting
     :END:
FD.io (Fast data – Input/Output) is a collection of several projects and
libraries to support flexible, programmable and composable services on a
generic hardware platform, using a high-throughput, low-latency and
resource-efficient IO services suitable to many architectures (x86, ARM,
and PowerPC) and deployment environments (bare metal, VM, container).

** Hardware Switch Architectures

