README.html

<li><a id="orgca6a421"></a>Honda et al.: <a href="http://doi.acm.org/10.1145/2774993.2775065"><b>mSwitch: A Highly-scalable, Modular Software Switch</b></a>, <i>ACM SOSR</i>, 2015.<br />
<div class="outline-text-5" id="text-orgca6a421">
<pre class="example">
RELEVANCE: interesting
</pre>
<p>
The authors make the observation that it is difficult to simultaneously
provide high packet rates, high throughput, low CPU usage, high port
density and a flexible data plane in a same architecture. A new
architecture called mSwitch is proposed and four distinct modules are
implemented on top: a learning bridge, an accelerated Open vSwitch module,
a protocol demultiplexer for userspace protocol stacks, and a filtering
module that can direct packets to virtualized middleboxes.
</p>
</div>
</li>

<li><a id="org17cac21"></a>Aurojit Panda et al.: <a href="https://www.usenix.org/system/files/conference/osdi16/osdi16-panda.pdf"><b>NetBricks: Taking the V out of NFV</b></a>, <i>USENIX OSDI</i>, 2016.<br />
<div class="outline-text-5" id="text-org17cac21">
<pre class="example">
RELEVANCE: interesting
</pre>
<p>
NetBricks is an NFV framework adopting the "graph-based" pipeline
abstraction and embracing type checking and safe runtimes to provide
isolation efficiently in software, providing the same memory isolation as
containers and VMs without incurring the same performance penalties. The
new isolation technique is called zero-copy software isolation.
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-org4ba6610" class="outline-4">
<h4 id="org4ba6610">The Match-action Abstraction</h4>
<div class="outline-text-4" id="text-org4ba6610">
</div>
<ul class="org-ul">
<li><a id="org758a2e8"></a>Ben Pfaff et al.: <a href="https://www.usenix.org/conference/nsdi15/technical-sessions/presentation/pfaff"><b>The Design and Implementation of Open vSwitch</b></a>, <i>USENIX NSDI</i>, 2015.<br />
<div class="outline-text-5" id="text-org758a2e8">
<pre class="example">
RELEVANCE: mustread
</pre>
<p>
The paper describes the design and implementation of Open vSwitch, a
multi-layer, open source virtual switch. The design document details the
advanced flow classification and caching techniques that Open vSwitch uses
to optimize its operations and conserve hypervisor resources.
</p>
</div>
</li>

<li><a id="org6b4e709"></a>Shahbaz et al.: <a href="http://doi.acm.org/10.1145/2934872.2934886"><b>PISCES: A Programmable, Protocol-Independent Software Switch</b></a>, <i>ACM SIGCOMM</i>, 2016.<br />
<div class="outline-text-5" id="text-org6b4e709">
<pre class="example">
RELEVANCE: interesting
</pre>
<p>
PISCES is a software switch derived from Open vSwitch (OVS), a hypervisor
switch whose behavior is customized using P4. PISCES is not hard-wired to
specific protocols; this independence makes it easy to add new
features. The paper also shows how the compiler can analyze the high-level
P4 specification to optimize forwarding performance; the evaluations show
that PISCES performs comparably to OVS but PISCES programs are about 40
times shorter than equivalent OVS source code.
</p>
</div>
</li>

<li><a id="orga17fa12"></a>Ethan Jackson et al.: <a href="https://www.usenix.org/conference/atc16/technical-sessions/presentation/jackson"><b>SoftFlow: A Middlebox Architecture for Open vSwitch</b></a>, <i>USENIX ATC</i>, 2016.<br />
<div class="outline-text-5" id="text-orga17fa12">
<pre class="example">
RELEVANCE: interesting
</pre>
<p>
The paper presents SoftFlow, an extension to Open vSwitch that seamlessly
integrates middlebox functionality while maintaining the familiar OpenFlow
forwarding model and performing significantly better than alternative
techniques for middlebox integration.
</p>
</div>
</li>

<li><a id="org1f9c530"></a>Molnár et al.: <a href="http://doi.acm.org/10.1145/2934872.2934887"><b>Dataplane Specialization for High-performance OpenFlow Software Switching</b></a>, <i>ACM SIGCOMM</i>, 2016.<br />
<div class="outline-text-5" id="text-org1f9c530">
<pre class="example">
RELEVANCE: mustread
</pre>
<p>
The authors argue that, instead of enforcing the same universal fast-path
semantics to all OpenFlow applications and optimizing for the common case,
as it is done in Open vSwitch, a programmable software switch should rather
automatically specialize its dataplane piecemeal with respect to the
configured workload. Tyey introduce ESwitch, a switch architecture that
uses on-the-fly template-based code generation to compile any OpenFlow
pipeline into efficient machine code, which can then be readily used as the
switch fast-path, delivering superior packet processing speed, improved
latency and CPU scalability, and predictable performance.
</p>
</div>
</li>

<li><a id="org66ad26d"></a>Rétvári et al.: <a href="https://conferences.sigcomm.org/sigcomm/2017/files/program-netpl/sigcomm17netpl-paper4.pdf"><b>Dynamic Compilation and Optimization of Packet Processing Programs</b></a>, <i>ACM SIGCOMM NetPL</i>, 2017.<br />
<div class="outline-text-5" id="text-org66ad26d">
<pre class="example">
RELEVANCE: interesting
</pre>
<p>
The paper makes the observation that data-plane compilation is
fundamentally statically, i.e., the input of the compiler is a fixed
description of the forwarding plane semantics and the output is code that
can accommodate any packet processing behavior set by the controller at
runtime. The authors advocate a dynamic approach to data plane compilation
instead, where not just the semantics but the intended behavior is also
also input to the compiler, opening the door to a handful of runtime
optimization opportunities that can be leveraged to improve the performance
of custom-compiled datapaths beyond what is possible in a static setting.
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-org6f1b975" class="outline-4">
<h4 id="org6f1b975">Packet I/O Libraries</h4>
<div class="outline-text-4" id="text-org6f1b975">
</div>
<ul class="org-ul">
<li><a id="orga216f7e"></a>Rizzo et al.: <a href="https://www.usenix.org/system/files/conference/atc12/atc12-final186.pdf"><b>Netmap: a novel framework for fast packet I/O</b></a>, <i>USENIX ATC</i>, 2012.<br />
<div class="outline-text-5" id="text-orga216f7e">
<pre class="example">
RELEVANCE: important
</pre>
<p>
Netmap is a framework that enables commodity operating systems to
handle the millions of packets per seconds, without requiring custom
hardware or changes to applications.  The idea is to eliminate
inefficiencies in OSes' standard packet processing datapaths: per-packet
dynamic memory allocations are removed by preallocating resources, system
call overheads are amortized over large I/O batches, and memory copies are
eliminated by sharing buffers and metadata between kernel and userspace,
while still protecting access to device registers and other kernel memory
areas.
</p>
</div>
</li>

<li><a id="org90e4719"></a>Intel et al.: <a href="http://dpdk.org"><b>Intel DPDK: Data Plane Development Kit</b></a>, <i>project website</i>, 2016.<br />
<div class="outline-text-5" id="text-org90e4719">
<pre class="example">
RELEVANCE: important
</pre>
<p>
DPDK is a set of libraries and drivers for fast packet processing,
including a multicore framework, huge page memory, ring buffers, poll-mode
drivers for networking I/O, crypto and eventdev, etc.  DPDK can be used to
receive and send packets within the minimum number of CPU cycles (usually
less than 80 cycles), develop fast packet capture algorithms (like
<code>tcpdump</code>), and run third-party fast path stacks.
</p>
</div>
</li>

<li><a id="orgc31f05c"></a>fd.io: <a href="https://fd.io"><b>The Fast Data Project</b></a>, <i>project website</i>, 2016.<br />
<div class="outline-text-5" id="text-orgc31f05c">
<pre class="example">
RELEVANCE: interesting
</pre>
<p>
FD.io (Fast data – Input/Output) is a collection of several projects and
libraries to support flexible, programmable and composable services on a
generic hardware platform, using a high-throughput, low-latency and
resource-efficient IO services suitable to many architectures (x86, ARM,
and PowerPC) and deployment environments (bare metal, VM, container).
</p>
</div>
</li>
</ul>
</div>
</div>
