README.org
**** De Carli et al.: [[http://doi.acm.org/10.1145/1592568.1592593][*PLUG: Flexible Lookup Modules for Rapid Deployment of New Protocols in High-speed Routers*]], /ACM SIGCOMM/, 2009.
     :PROPERTIES:
     :RELEVANCE:   mustread
     :END:
The first incarnation of the "programmable switch". PLUG (Pipelined Lookup
Grid) is a flexible lookup module that can achieve generality without
loosing efficiency, because various custom lookup modules have the same
fundamental features that PLUG retains: area dominated by memories, simple
processing, and strict access patterns defined by the data structure. The
authors IPv4, Ethernet, Ethane, and SEATTLE in a dataflow-based programming
model for the PLUG and mapped them to the PLUG hardware, showing that
throughput, area, power, and latency of PLUGs are close to those of
specialized lookup modules.

**** Anwer et al.: [[http://doi.acm.org/10.1145/1851182.1851206][*SwitchBlade: A Platform for Rapid Deployment of Network Protocols on Programmable Hardware*]], /ACM SIGCOMM/, 2010.
     :PROPERTIES:
     :RELEVANCE:   important
     :END:
SwitchBlade is a platform for rapidly deploying custom protocols on
programmable hardware. SwitchBlade uses a pipeline-based design that allows
individual hardware modules to be enabled or disabled on the fly,
integrates common packet-processing functions as hardware modules enabling
different protocols to use these functions without having to resynthesize
hardware, and uses a customizable forwarding engine that supports both
longest-prefix matching in the packet header and exact matching on a hash
value. SwitchBlade also allows multiple custom data planes to operate in
parallel on the same physical hardware, while providing complete isolation
for protocols running in parallel.

**** Bosshart et al.: [[http://doi.acm.org/10.1145/2486001.2486011][*Forwarding Metamorphosis: Fast Programmable Match-action Processing in Hardware for SDN*]], /ACM SIGCOMM/, 2013.
     :PROPERTIES:
     :RELEVANCE:   mustread
     :END:
This seminal paper presents RMT to overcome two limitations in current
switching chips and OpenFlow: (1) conventional hardware switches are rigid,
allowing "Match-Action" processing on only a fixed set of fields, and (2)
the OpenFlow specification only defines a limited repertoire of packet
processing actions. The RMT (Reconfigurable Match Tables) model is a
RISC-inspired pipelined architecture for switching chips, including an
essential minimal set of action primitives to specify how headers are
processed in hardware. RMT allows the forwarding plane to be changed in the
field without modifying hardware.

**** Brebner et al.: [[https://doi.org/10.1109/MM.2014.19][*High-Speed Packet Processing using Reconfigurable Computing*]], /IEEE Micro/, 2014.
     :PROPERTIES:
     :RELEVANCE:   interesting
     :END:
The paper presents a tool chain that maps a domain-specific declarative
packet-processing language with object-oriented semantics, called PX, to
high-performance reconfigurable-computing architectures based on
field-programmable gate array (FPGA) technology, including components for
packet parsing, editing, and table lookups.

**** Li et al.: [[http://doi.acm.org/10.1145/2934872.2934897][*ClickNP: Highly Flexible and High Performance Network Processing with Reconfigurable Hardware*]], /ACM SIGCOMM/, 2016.
     :PROPERTIES:
     :RELEVANCE:   interesting
     :END:
This paper focuses on accelerating NFs with FPGAs. However, FPGA is
predominately programmed using low-level hardware description languages
(HDLs), which are hard to code and difficult to debug. More importantly,
HDLs are almost inaccessible for most software programmers. This paper
presents ClickNP, a FPGA-accelerated platform, which is highly flexible as
it is completely programmable using high-level C-like languages and exposes
a modular programming abstraction that resembles Click Modular Router, and
also high performance.

**** Chole et al.: [[http://doi.acm.org/10.1145/3098822.3098823][*dRMT: Disaggregated Programmable Switching*]], /ACM SIGCOMM/, 2017.
     :PROPERTIES:
     :RELEVANCE:   important
     :END:
A follow-up to the RMT paper. dRMT (disaggregated Reconfigurable
Match-Action Table) is a new architecture for programmable switches, which
overcomes two important restrictions of RMT: (1) table memory is local to
an RMT pipeline stage, implying that memory not used by one stage cannot be
reclaimed by another, and (2) RMT is hardwired to always sequentially
execute matches followed by actions as packets traverse pipeline
stages. dRMT resolves both issues by disaggregating the memory and compute
resources of a programmable switch, moving table memories out of pipeline
stages and into a centralized pool that is accessible through a
crossbar. In addition, dRMT replaces RMT's pipeline stages with a cluster
of processors that can execute match and action operations in any order.

**** Narayana et al.: [[http://doi.acm.org/10.1145/3098822.3098829][*Language-Directed Hardware Design for Network Performance Monitoring*]], /ACM SIGCOMM/, 2017.
     :PROPERTIES:
     :RELEVANCE:   interesting
     :END:
The authors ask what switch hardware primitives are required to support an
expressive language of network performance questions. They present a
performance query language, Marple, modeled on familiar functional
constructs, backed by a new programmable key-value store primitive on
switch hardware that performs flexible aggregations at line rate and scales
to millions of keys. Marple can express switch queries that could
previously run only on end hosts, while Marple queries only occupy a modest
fraction of a switch's hardware resources.

** Hybrid Hardware/Software Architectures

**** Han et al.: [[http://doi.acm.org/10.1145/1851182.1851207][*PacketShader: A GPU-accelerated Software Router*]], /ACM SIGCOMM/, 2010.
     :PROPERTIES:
     :RELEVANCE:   important
     :END:
PacketShader is a high-performance software router framework for general
packet processing with Graphics Processing Unit (GPU) acceleration,
exploiting the massively-parallel processing power of GPU to address the
CPU bottleneck in software routers, combined with a high-performance packet
I/O engine. The paper presents implementations for IPv4 and IPv6
forwarding, OpenFlow switching, and IPsec tunneling to demonstrate the
flexibility and performance advantage of PacketShader. 

**** Pongrácz et al.: [[http://doi.acm.org/10.1145/2491185.2491204][*Cheap Silicon: A Myth or Reality Picking the Right Data Plane Hardware for Software Defined Networking*]], /ACM HotSDN/, 2013.
     :PROPERTIES:
     :RELEVANCE:   interesting
     :END:
Industry insight holds that programmable network processors are of lower
performance than their hard-coded counterparts, such as Ethernet chips. The
paper argues that, contrast to the common view, the overhead of
programmability is relatively low, and that the apparent difference between
programmable and hard-coded chips is not primarily due to programmability
itself, but because the internal balance of programmable network processors
is tuned to more complex use cases.

