README.html

<div id="outline-container-org0d73d53" class="outline-3">
<h3 id="org0d73d53">Hardware Switch Architectures</h3>
<div class="outline-text-3" id="text-org0d73d53">
</div>
<ul class="org-ul">
<li><a id="org9242aa0"></a>De Carli et al.: <a href="http://doi.acm.org/10.1145/1592568.1592593"><b>PLUG: Flexible Lookup Modules for Rapid Deployment of New Protocols in High-speed Routers</b></a>, <i>ACM SIGCOMM</i>, 2009.<br />
<div class="outline-text-5" id="text-org9242aa0">
<pre class="example">
RELEVANCE: mustread
</pre>
<p>
The first incarnation of the "programmable switch". PLUG (Pipelined Lookup
Grid) is a flexible lookup module that can achieve generality without
loosing efficiency, because various custom lookup modules have the same
fundamental features that PLUG retains: area dominated by memories, simple
processing, and strict access patterns defined by the data structure. The
authors IPv4, Ethernet, Ethane, and SEATTLE in a dataflow-based programming
model for the PLUG and mapped them to the PLUG hardware, showing that
throughput, area, power, and latency of PLUGs are close to those of
specialized lookup modules.
</p>
</div>
</li>

<li><a id="orge9437b5"></a>Anwer et al.: <a href="http://doi.acm.org/10.1145/1851182.1851206"><b>SwitchBlade: A Platform for Rapid Deployment of Network Protocols on Programmable Hardware</b></a>, <i>ACM SIGCOMM</i>, 2010.<br />
<div class="outline-text-5" id="text-orge9437b5">
<pre class="example">
RELEVANCE: important
</pre>
<p>
SwitchBlade is a platform for rapidly deploying custom protocols on
programmable hardware. SwitchBlade uses a pipeline-based design that allows
individual hardware modules to be enabled or disabled on the fly,
integrates common packet-processing functions as hardware modules enabling
different protocols to use these functions without having to resynthesize
hardware, and uses a customizable forwarding engine that supports both
longest-prefix matching in the packet header and exact matching on a hash
value. SwitchBlade also allows multiple custom data planes to operate in
parallel on the same physical hardware, while providing complete isolation
for protocols running in parallel.
</p>
</div>
</li>

<li><a id="org81b336f"></a>Bosshart et al.: <a href="http://doi.acm.org/10.1145/2486001.2486011"><b>Forwarding Metamorphosis: Fast Programmable Match-action Processing in Hardware for SDN</b></a>, <i>ACM SIGCOMM</i>, 2013.<br />
<div class="outline-text-5" id="text-org81b336f">
<pre class="example">
RELEVANCE: mustread
</pre>
<p>
This seminal paper presents RMT to overcome two limitations in current
switching chips and OpenFlow: (1) conventional hardware switches are rigid,
allowing "Match-Action" processing on only a fixed set of fields, and (2)
the OpenFlow specification only defines a limited repertoire of packet
processing actions. The RMT (Reconfigurable Match Tables) model is a
RISC-inspired pipelined architecture for switching chips, including an
essential minimal set of action primitives to specify how headers are
processed in hardware. RMT allows the forwarding plane to be changed in the
field without modifying hardware.
</p>
</div>
</li>

<li><a id="org4c1eaa7"></a>Brebner et al.: <a href="https://doi.org/10.1109/MM.2014.19"><b>High-Speed Packet Processing using Reconfigurable Computing</b></a>, <i>IEEE Micro</i>, 2014.<br />
<div class="outline-text-5" id="text-org4c1eaa7">
<pre class="example">
RELEVANCE: interesting
</pre>
<p>
The paper presents a tool chain that maps a domain-specific declarative
packet-processing language with object-oriented semantics, called PX, to
high-performance reconfigurable-computing architectures based on
field-programmable gate array (FPGA) technology, including components for
packet parsing, editing, and table lookups.
</p>
</div>
</li>

<li><a id="org7971c03"></a>Li et al.: <a href="http://doi.acm.org/10.1145/2934872.2934897"><b>ClickNP: Highly Flexible and High Performance Network Processing with Reconfigurable Hardware</b></a>, <i>ACM SIGCOMM</i>, 2016.<br />
<div class="outline-text-5" id="text-org7971c03">
<pre class="example">
RELEVANCE: interesting
</pre>
<p>
This paper focuses on accelerating NFs with FPGAs. However, FPGA is
predominately programmed using low-level hardware description languages
(HDLs), which are hard to code and difficult to debug. More importantly,
HDLs are almost inaccessible for most software programmers. This paper
presents ClickNP, a FPGA-accelerated platform, which is highly flexible as
it is completely programmable using high-level C-like languages and exposes
a modular programming abstraction that resembles Click Modular Router, and
also high performance.
</p>
</div>
</li>

<li><a id="orga627bf1"></a>Chole et al.: <a href="http://doi.acm.org/10.1145/3098822.3098823"><b>dRMT: Disaggregated Programmable Switching</b></a>, <i>ACM SIGCOMM</i>, 2017.<br />
<div class="outline-text-5" id="text-orga627bf1">
<pre class="example">
RELEVANCE: important
</pre>
<p>
A follow-up to the RMT paper. dRMT (disaggregated Reconfigurable
Match-Action Table) is a new architecture for programmable switches, which
overcomes two important restrictions of RMT: (1) table memory is local to
an RMT pipeline stage, implying that memory not used by one stage cannot be
reclaimed by another, and (2) RMT is hardwired to always sequentially
execute matches followed by actions as packets traverse pipeline
stages. dRMT resolves both issues by disaggregating the memory and compute
resources of a programmable switch, moving table memories out of pipeline
stages and into a centralized pool that is accessible through a
crossbar. In addition, dRMT replaces RMT's pipeline stages with a cluster
of processors that can execute match and action operations in any order.
</p>
</div>
</li>

<li><a id="orgd70ca8b"></a>Narayana et al.: <a href="http://doi.acm.org/10.1145/3098822.3098829"><b>Language-Directed Hardware Design for Network Performance Monitoring</b></a>, <i>ACM SIGCOMM</i>, 2017.<br />
<div class="outline-text-5" id="text-orgd70ca8b">
<pre class="example">
RELEVANCE: interesting
</pre>
<p>
The authors ask what switch hardware primitives are required to support an
expressive language of network performance questions. They present a
performance query language, Marple, modeled on familiar functional
constructs, backed by a new programmable key-value store primitive on
switch hardware that performs flexible aggregations at line rate and scales
to millions of keys. Marple can express switch queries that could
previously run only on end hosts, while Marple queries only occupy a modest
fraction of a switch's hardware resources.
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-orgcb0aa6e" class="outline-3">
<h3 id="orgcb0aa6e">Hybrid Hardware/Software Architectures</h3>
<div class="outline-text-3" id="text-orgcb0aa6e">
</div>
<ul class="org-ul">
<li><a id="orgece9b05"></a>Han et al.: <a href="http://doi.acm.org/10.1145/1851182.1851207"><b>PacketShader: A GPU-accelerated Software Router</b></a>, <i>ACM SIGCOMM</i>, 2010.<br />
<div class="outline-text-5" id="text-orgece9b05">
<pre class="example">
RELEVANCE: important
</pre>
<p>
PacketShader is a high-performance software router framework for general
packet processing with Graphics Processing Unit (GPU) acceleration,
exploiting the massively-parallel processing power of GPU to address the
CPU bottleneck in software routers, combined with a high-performance packet
I/O engine. The paper presents implementations for IPv4 and IPv6
forwarding, OpenFlow switching, and IPsec tunneling to demonstrate the
flexibility and performance advantage of PacketShader. 
</p>
</div>
</li>

<li><a id="org6213999"></a>Pongrácz et al.: <a href="http://doi.acm.org/10.1145/2491185.2491204"><b>Cheap Silicon: A Myth or Reality Picking the Right Data Plane Hardware for Software Defined Networking</b></a>, <i>ACM HotSDN</i>, 2013.<br />
<div class="outline-text-5" id="text-org6213999">
<pre class="example">
RELEVANCE: interesting
</pre>
<p>
Industry insight holds that programmable network processors are of lower
performance than their hard-coded counterparts, such as Ethernet chips. The
paper argues that, contrast to the common view, the overhead of
programmability is relatively low, and that the apparent difference between
programmable and hard-coded chips is not primarily due to programmability
itself, but because the internal balance of programmable network processors
is tuned to more complex use cases.
</p>
</div>
</li>
