README.org
**** Kalia et al.: [[https://www.usenix.org/system/files/conference/nsdi15/nsdi15-paper-kalia.pdf][*Raising the Bar for Using GPUs in Software Packet Processing*]], /USENIX NSDI/, 2015.
     :PROPERTIES:
     :RELEVANCE:   interesting
     :END:
The paper opens the debate as to whether Graphics Processing Units (GPUs)
are indeed useful as accelerators for software-based routing and packet
handling applications. The authors argue that for many such applications
the benefits arise less from the GPU hardware itself as from the expression
of the problem in a language such as CUDA or OpenCL that facilitates memory
latency hiding and vectorization through massive concurrency. They then
demonstrate that applying a similar style of optimization to algorithm
implementations, a CPU-only implementation is more resource efficient than
the version running on the GPU.

**** Kaufmann et al.: [[http://doi.acm.org/10.1145/2954679.2872367][*High Performance Packet Processing with FlexNIC*]], /ACM SIGPLAN Not./, 2016.
     :PROPERTIES:
     :RELEVANCE:   interesting
     :END:
The authors argue that the primary reason for high memory and processing
overheads inherent to packer processing applications is the inefficient use
of the memory and I/O resources by commodity network interface cards
(NICs). They propose FlexNIC, a flexible network DMA interface that can be
used to reduce packet processing overheads; FlexNIC allows services to
install packet processing rules into the NIC, which then executes simple
operations on packets while exchanging them with host memory. This moves
some of the packet processing traditionally done in software to the NIC,
where it can be done flexibly and at high speed.

**** Younghwan Go et al.: [[https://www.usenix.org/conference/nsdi17/technical-sessions/presentation/go][*APUNet: Revitalizing GPU as Packet Processing Accelerator*]], /USENIX NSDI/, 2017.
     :PROPERTIES:
     :RELEVANCE:   interesting
     :END:
This is the answer to the question raised by the previous paper.  Kalia et
al. argue that the key enabler for high packet-processing performance is
the inherent feature of GPU that automatically hides memory access latency
rather than its parallel computation power and claim that CPU can
outperform or achieve a similar performance as GPU if its code is
re-arranged to run concurrently with memory access. This paper revists
these claims and find, with eight popular algorithms widely used in network
applications, that (a) there are many compute-bound algorithms that do
benefit from the parallel computation capacity of GPU while CPU-based
optimizations fail to help, and (b) the relative performance advantage of
CPU over GPU in most applications is due to data transfer bottleneck in
PCIe communication of discrete GPU rather than lack of capacity of GPU
itself.

**** Katta et al.: [[http://doi.acm.org/10.1145/2890955.2890969][*CacheFlow: Dependency-Aware Rule-Caching for Software-Defined Networks*]], /ACM SOSR/, 2016.
     :PROPERTIES:
     :RELEVANCE:   interesting
     :END:
The paper presents an architecture to allow high-speed forwarding even with
large rule tables and fast updates, by combining the best of hardware and
software processing. The CacheFlow system caches the most popular rules in
the small TCAM and relies on software to handle the small amount of
cache-miss traffic. The authors observe that one cannot blindly apply
existing cache-replacement algorithms, because of dependencies between
rules with overlapping patterns. Rather long dependency chains must be
broken to cache smaller groups of rules while preserving the semantics of
the policy.

* Miscellaneous Topics

** History

**** Feamster et al.: [[http://doi.acm.org/10.1145/2559899.2560327][*The Road to SDN*]], /ACM Queue/, 2013.
     :PROPERTIES:
     :RELEVANCE:   mustread
     :END:
An intellectual history of programmable networks. A mustread.

**** Zilberman et al.: [[https://doi.org/10.1109/JPROC.2015.2435732][*Reconfigurable Network Systems and Software-Defined Networking*]], /Proceedings of the IEEE/, 2015.
     :PROPERTIES:
     :RELEVANCE:   interesting
     :END:
The paper reviews the state of the art in reconfigurable network systems,
covering hardware reconfiguration, SDN, and the interplay between them. It
starts with a tutorial on software-defined networks, then continues to
discuss programming languages as the linking element between different
levels of software and hardware in the network, reviews electronic
switching systems, highlighting programmability and reconfiguration
aspects, and describes the trends in reconfigurable network
elements.

**** Nick McKeown et al.: [[https://conferences.sigcomm.org/sigcomm/2017/files/program-netpl/01-mckeown.pptx][*Programmable Forwarding Planes are Here to Stay*]], /ACM SIGCOMM NetPL/, 2017.
     :PROPERTIES:
     :RELEVANCE:   mustread
     :END:
A keynote from Nick McKeown at NetPL'17 on the many great research ideas
and new languages that have emerged for programmable forwarding. The talk
considers how we got here, why programmable forwarding planes are
inevitable, why now is the right time, why they are a final frontier for
SDN, and why they are here to stay.

** Large-scale Deployments

**** Casado et al.: [[http://doi.acm.org/10.1145/1282380.1282382][*Ethane: Taking Control of the Enterprise*]], /ACM SIGCOMM/, 2007.
     :PROPERTIES:
     :RELEVANCE:   mustread
     :END:
A seminal paper for deploying SDN in enterprise networks, this paper
presents Ethane, a network architecture allowing managers to define a
single network-wide fine-grain policy and then enforcing it
directly. Ethane couples extremely simple flow-based Ethernet switches with
a centralized controller that manages the admittance and routing of
flows. While radical, this design is backwards-compatible with existing
hosts and switches.  Ethane was implemented in both hardware and software,
supporting both wired and wireless hosts.

**** Jain et al.: [[http://doi.acm.org/10.1145/2486001.2486019][*B4: Experience with a Globally-deployed Software Defined Wan*]], /ACM SIGCOMM/, 2013.
     :PROPERTIES:
     :RELEVANCE:   important
     :END:
The paper presents the design, implementation, and evaluation of B4, a
private WAN connecting Google's data centers across the planet. B4 has a
number of unique characteristics: (1) massive bandwidth requirements
deployed to a modest number of sites, (2) elastic traffic demand that seeks
to maximize average bandwidth, and (3) full control over the edge servers
and network, which enables rate limiting and demand measurement at the
edge. These characteristics led to a Software Defined Networking architecture
using OpenFlow to control relatively simple switches built from merchant
silicon.

