README.html

<li><a id="org4f84f50"></a>Kalia et al.: <a href="https://www.usenix.org/system/files/conference/nsdi15/nsdi15-paper-kalia.pdf"><b>Raising the Bar for Using GPUs in Software Packet Processing</b></a>, <i>USENIX NSDI</i>, 2015.<br />
<div class="outline-text-5" id="text-org4f84f50">
<pre class="example">
RELEVANCE: interesting
</pre>
<p>
The paper opens the debate as to whether Graphics Processing Units (GPUs)
are indeed useful as accelerators for software-based routing and packet
handling applications. The authors argue that for many such applications
the benefits arise less from the GPU hardware itself as from the expression
of the problem in a language such as CUDA or OpenCL that facilitates memory
latency hiding and vectorization through massive concurrency. They then
demonstrate that applying a similar style of optimization to algorithm
implementations, a CPU-only implementation is more resource efficient than
the version running on the GPU.
</p>
</div>
</li>

<li><a id="org6d5f0d9"></a>Kaufmann et al.: <a href="http://doi.acm.org/10.1145/2954679.2872367"><b>High Performance Packet Processing with FlexNIC</b></a>, <i>ACM SIGPLAN Not.</i>, 2016.<br />
<div class="outline-text-5" id="text-org6d5f0d9">
<pre class="example">
RELEVANCE: interesting
</pre>
<p>
The authors argue that the primary reason for high memory and processing
overheads inherent to packer processing applications is the inefficient use
of the memory and I/O resources by commodity network interface cards
(NICs). They propose FlexNIC, a flexible network DMA interface that can be
used to reduce packet processing overheads; FlexNIC allows services to
install packet processing rules into the NIC, which then executes simple
operations on packets while exchanging them with host memory. This moves
some of the packet processing traditionally done in software to the NIC,
where it can be done flexibly and at high speed.
</p>
</div>
</li>

<li><a id="orga6925ee"></a>Younghwan Go et al.: <a href="https://www.usenix.org/conference/nsdi17/technical-sessions/presentation/go"><b>APUNet: Revitalizing GPU as Packet Processing Accelerator</b></a>, <i>USENIX NSDI</i>, 2017.<br />
<div class="outline-text-5" id="text-orga6925ee">
<pre class="example">
RELEVANCE: interesting
</pre>
<p>
This is the answer to the question raised by the previous paper.  Kalia et
al. argue that the key enabler for high packet-processing performance is
the inherent feature of GPU that automatically hides memory access latency
rather than its parallel computation power and claim that CPU can
outperform or achieve a similar performance as GPU if its code is
re-arranged to run concurrently with memory access. This paper revists
these claims and find, with eight popular algorithms widely used in network
applications, that (a) there are many compute-bound algorithms that do
benefit from the parallel computation capacity of GPU while CPU-based
optimizations fail to help, and (b) the relative performance advantage of
CPU over GPU in most applications is due to data transfer bottleneck in
PCIe communication of discrete GPU rather than lack of capacity of GPU
itself.
</p>
</div>
</li>

<li><a id="org3fff333"></a>Katta et al.: <a href="http://doi.acm.org/10.1145/2890955.2890969"><b>CacheFlow: Dependency-Aware Rule-Caching for Software-Defined Networks</b></a>, <i>ACM SOSR</i>, 2016.<br />
<div class="outline-text-5" id="text-org3fff333">
<pre class="example">
RELEVANCE: interesting
</pre>
<p>
The paper presents an architecture to allow high-speed forwarding even with
large rule tables and fast updates, by combining the best of hardware and
software processing. The CacheFlow system caches the most popular rules in
the small TCAM and relies on software to handle the small amount of
cache-miss traffic. The authors observe that one cannot blindly apply
existing cache-replacement algorithms, because of dependencies between
rules with overlapping patterns. Rather long dependency chains must be
broken to cache smaller groups of rules while preserving the semantics of
the policy.
</p>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-org3a69e50" class="outline-2">
<h2 id="org3a69e50">Miscellaneous Topics</h2>
<div class="outline-text-2" id="text-org3a69e50">
</div>
<div id="outline-container-orgba4fa94" class="outline-3">
<h3 id="orgba4fa94">History</h3>
<div class="outline-text-3" id="text-orgba4fa94">
</div>
<ul class="org-ul">
<li><a id="orgb6b2064"></a>Feamster et al.: <a href="http://doi.acm.org/10.1145/2559899.2560327"><b>The Road to SDN</b></a>, <i>ACM Queue</i>, 2013.<br />
<div class="outline-text-5" id="text-orgb6b2064">
<pre class="example">
RELEVANCE: mustread
</pre>
<p>
An intellectual history of programmable networks. A mustread.
</p>
</div>
</li>

<li><a id="org3c7167d"></a>Zilberman et al.: <a href="https://doi.org/10.1109/JPROC.2015.2435732"><b>Reconfigurable Network Systems and Software-Defined Networking</b></a>, <i>Proceedings of the IEEE</i>, 2015.<br />
<div class="outline-text-5" id="text-org3c7167d">
<pre class="example">
RELEVANCE: interesting
</pre>
<p>
The paper reviews the state of the art in reconfigurable network systems,
covering hardware reconfiguration, SDN, and the interplay between them. It
starts with a tutorial on software-defined networks, then continues to
discuss programming languages as the linking element between different
levels of software and hardware in the network, reviews electronic
switching systems, highlighting programmability and reconfiguration
aspects, and describes the trends in reconfigurable network
elements.
</p>
</div>
</li>

<li><a id="orgf090277"></a>Nick McKeown et al.: <a href="https://conferences.sigcomm.org/sigcomm/2017/files/program-netpl/01-mckeown.pptx"><b>Programmable Forwarding Planes are Here to Stay</b></a>, <i>ACM SIGCOMM NetPL</i>, 2017.<br />
<div class="outline-text-5" id="text-orgf090277">
<pre class="example">
RELEVANCE: mustread
</pre>
<p>
A keynote from Nick McKeown at NetPL'17 on the many great research ideas
and new languages that have emerged for programmable forwarding. The talk
considers how we got here, why programmable forwarding planes are
inevitable, why now is the right time, why they are a final frontier for
SDN, and why they are here to stay.
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-org51cea19" class="outline-3">
<h3 id="org51cea19">Large-scale Deployments</h3>
<div class="outline-text-3" id="text-org51cea19">
</div>
<ul class="org-ul">
<li><a id="org40eecfa"></a>Casado et al.: <a href="http://doi.acm.org/10.1145/1282380.1282382"><b>Ethane: Taking Control of the Enterprise</b></a>, <i>ACM SIGCOMM</i>, 2007.<br />
<div class="outline-text-5" id="text-org40eecfa">
<pre class="example">
RELEVANCE: mustread
</pre>
<p>
A seminal paper for deploying SDN in enterprise networks, this paper
presents Ethane, a network architecture allowing managers to define a
single network-wide fine-grain policy and then enforcing it
directly. Ethane couples extremely simple flow-based Ethernet switches with
a centralized controller that manages the admittance and routing of
flows. While radical, this design is backwards-compatible with existing
hosts and switches.  Ethane was implemented in both hardware and software,
supporting both wired and wireless hosts.
</p>
</div>
</li>

<li><a id="org7952b27"></a>Jain et al.: <a href="http://doi.acm.org/10.1145/2486001.2486019"><b>B4: Experience with a Globally-deployed Software Defined Wan</b></a>, <i>ACM SIGCOMM</i>, 2013.<br />
<div class="outline-text-5" id="text-org7952b27">
<pre class="example">
RELEVANCE: important
</pre>
<p>
The paper presents the design, implementation, and evaluation of B4, a
private WAN connecting Google's data centers across the planet. B4 has a
number of unique characteristics: (1) massive bandwidth requirements
deployed to a modest number of sites, (2) elastic traffic demand that seeks
to maximize average bandwidth, and (3) full control over the edge servers
and network, which enables rate limiting and demand measurement at the
edge. These characteristics led to a Software Defined Networking architecture
using OpenFlow to control relatively simple switches built from merchant
silicon.
</p>
</div>
</li>
