README.org
**** Qazi et al.: [[http://doi.acm.org/10.1145/3098822.3098848][*A High Performance Packet Core for Next Generation Cellular Networks*]], /ACM SIGCOMM/, 2017.
     :PROPERTIES:
     :RELEVANCE:   important
     :END:
To support deploying SDNs into the Evolved Packet Core (EPC), the paper
presents the design and evaluation of a system architecture for a software
EPC that achieves high and scalable performance. The authors postulate that
the poor scaling of existing EPC systems stems from the manner in which the
system is decomposed, which leads to device state being duplicated across
multiple components, which in turn results in frequent interactions between
the different components. An alternate approach is proposed in which state
for a single device is consolidated in one location and EPC functions are
reorganized for efficient access to this consolidated state. A prototype
for PEPC is also presented, as a software EPC that implements the key
components of the design.

** In-Network Computation

**** Sapio et al.: *[[http://doi.acm.org/10.1145/3152434.3152461][In-Network Computation is a Dumb Idea Whose Time Has Come]]*, /ACM HotNets/, 2017.
     :PROPERTIES:
     :RELEVANCE: important
     :END:
The authors ask the question, given that programmable data plane hardware
creates new opportunities for infusing intelligence into the network, what
kinds of computation should be delegated to the data plane? The paper
discusses the opportunities and challenges for co-designing data center
distributed systems with their network layer, under the constraints imposed
by the limitations of the network machine architecture of programmable
devices. They find that, in particular, aggregation functions raise
opportunities to exploit the limited computation power of networking
hardware to lessen network congestion and improve the overall application
performance.


* COMMENT Local variables
# Local variables:
# eval: (setq reftex-cite-format "%A et al.: [[%U][*%t*]], /%h/, %y.\n")
# End:

