README.html

<li><a id="org7f7fdc4"></a>Qazi et al.: <a href="http://doi.acm.org/10.1145/3098822.3098848"><b>A High Performance Packet Core for Next Generation Cellular Networks</b></a>, <i>ACM SIGCOMM</i>, 2017.<br />
<div class="outline-text-5" id="text-org7f7fdc4">
<pre class="example">
RELEVANCE: important
</pre>
<p>
To support deploying SDNs into the Evolved Packet Core (EPC), the paper
presents the design and evaluation of a system architecture for a software
EPC that achieves high and scalable performance. The authors postulate that
the poor scaling of existing EPC systems stems from the manner in which the
system is decomposed, which leads to device state being duplicated across
multiple components, which in turn results in frequent interactions between
the different components. An alternate approach is proposed in which state
for a single device is consolidated in one location and EPC functions are
reorganized for efficient access to this consolidated state. A prototype
for PEPC is also presented, as a software EPC that implements the key
components of the design.
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-org29058f7" class="outline-3">
<h3 id="org29058f7">In-Network Computation</h3>
<div class="outline-text-3" id="text-org29058f7">
</div>
<ul class="org-ul">
<li><a id="orgef77aee"></a>Sapio et al.: <b><a href="http://doi.acm.org/10.1145/3152434.3152461">In-Network Computation is a Dumb Idea Whose Time Has Come</a></b>, <i>ACM HotNets</i>, 2017.<br />
<div class="outline-text-5" id="text-orgef77aee">
<pre class="example">
RELEVANCE: important
</pre>
<p>
The authors ask the question, given that programmable data plane hardware
creates new opportunities for infusing intelligence into the network, what
kinds of computation should be delegated to the data plane? The paper
discusses the opportunities and challenges for co-designing data center
distributed systems with their network layer, under the constraints imposed
by the limitations of the network machine architecture of programmable
devices. They find that, in particular, aggregation functions raise
opportunities to exploit the limited computation power of networking
hardware to lessen network congestion and improve the overall application
performance.
</p>
</div>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Roberto Bifulco, Gábor Rétvári</p>
<p class="date">Created: 2018-04-16 Mon 15:25</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
